jmeter/test-result/7-springboot-microservice-jpa/statistics.json
{
  "UpdateActivationRecord - 信用卡開卡 更新信用卡狀態" : {
    "transaction" : "UpdateActivationRecord - 信用卡開卡 更新信用卡狀態",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 38.620000000000005,
    "medianResTime" : 37.0,
    "minResTime" : 34.0,
    "maxResTime" : 65.0,
    "pct1ResTime" : 45.0,
    "pct2ResTime" : 48.0,
    "pct3ResTime" : 60.98000000000002,
    "throughput" : 2.386672818978822,
    "receivedKBytesPerSec" : 0.6176448213177617,
    "sentKBytesPerSec" : 0.745835255930882
  },
  "InsertBill - 產生各消費者的月結帳單" : {
    "transaction" : "InsertBill - 產生各消費者的月結帳單",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.723333333333336,
    "medianResTime" : 26.0,
    "minResTime" : 12.0,
    "maxResTime" : 33.0,
    "pct1ResTime" : 28.0,
    "pct2ResTime" : 29.0,
    "pct3ResTime" : 32.98000000000002,
    "throughput" : 2.387299566307245,
    "receivedKBytesPerSec" : 0.6224697111367524,
    "sentKBytesPerSec" : 1.9560003282536902
  },
  "FindCusBill - 查詢該月帳單的所有客戶資料" : {
    "transaction" : "FindCusBill - 查詢該月帳單的所有客戶資料",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 23.046666666666653,
    "medianResTime" : 23.0,
    "minResTime" : 20.0,
    "maxResTime" : 28.0,
    "pct1ResTime" : 24.0,
    "pct2ResTime" : 25.0,
    "pct3ResTime" : 26.0,
    "throughput" : 2.389276925159882,
    "receivedKBytesPerSec" : 1.5352970866750024,
    "sentKBytesPerSec" : 0.557653501087121
  },
  "GetActivatedCardHolder - 查詢有效卡片持有者資料" : {
    "transaction" : "GetActivatedCardHolder - 查詢有效卡片持有者資料",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.906666666666673,
    "medianResTime" : 26.0,
    "minResTime" : 10.0,
    "maxResTime" : 35.0,
    "pct1ResTime" : 28.0,
    "pct2ResTime" : 28.0,
    "pct3ResTime" : 32.99000000000001,
    "throughput" : 2.3868816981867655,
    "receivedKBytesPerSec" : 2.3006369493265018,
    "sentKBytesPerSec" : 0.7389077132082077
  },
  "FindCusBillAll - 查詢該月帳單的\"特定\"客戶資料" : {
    "transaction" : "FindCusBillAll - 查詢該月帳單的\"特定\"客戶資料",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 71.94666666666666,
    "medianResTime" : 58.0,
    "minResTime" : 50.0,
    "maxResTime" : 349.0,
    "pct1ResTime" : 101.90000000000003,
    "pct2ResTime" : 138.0,
    "pct3ResTime" : 320.7500000000002,
    "throughput" : 2.3871286025749163,
    "receivedKBytesPerSec" : 2647.1880806193008,
    "sentKBytesPerSec" : 0.7180035249932364
  },
  "InsertCusDateBill - 客戶使用信用卡消費計入消費紀錄" : {
    "transaction" : "InsertCusDateBill - 客戶使用信用卡消費計入消費紀錄",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 27.526666666666674,
    "medianResTime" : 27.0,
    "minResTime" : 24.0,
    "maxResTime" : 38.0,
    "pct1ResTime" : 30.0,
    "pct2ResTime" : 31.0,
    "pct3ResTime" : 35.0,
    "throughput" : 2.3893530428411,
    "receivedKBytesPerSec" : 0.6393386071664662,
    "sentKBytesPerSec" : 1.572679639526271
  },
  "CreateCuscredit - 新增客戶信用卡資訊" : {
    "transaction" : "CreateCuscredit - 新增客戶信用卡資訊",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 24.88666666666668,
    "medianResTime" : 24.0,
    "minResTime" : 20.0,
    "maxResTime" : 97.0,
    "pct1ResTime" : 28.0,
    "pct2ResTime" : 30.0,
    "pct3ResTime" : 66.87000000000012,
    "throughput" : 2.386236189658052,
    "receivedKBytesPerSec" : 0.6338439878779202,
    "sentKBytesPerSec" : 2.232435810246498
  },
  "UpdateDisputedFlag - 爭議款項申請:上註記" : {
    "transaction" : "UpdateDisputedFlag - 爭議款項申請:上註記",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.18333333333333,
    "medianResTime" : 9.0,
    "minResTime" : 7.0,
    "maxResTime" : 55.0,
    "pct1ResTime" : 12.0,
    "pct2ResTime" : 13.0,
    "pct3ResTime" : 46.99000000000001,
    "throughput" : 2.387622564624984,
    "receivedKBytesPerSec" : 0.6085639544600789,
    "sentKBytesPerSec" : 0.7507953767668407
  },
  "FindCusBill - 本期信用卡帳單查詢" : {
    "transaction" : "FindCusBill - 本期信用卡帳單查詢",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.586666666666666,
    "medianResTime" : 22.0,
    "minResTime" : 19.0,
    "maxResTime" : 28.0,
    "pct1ResTime" : 23.0,
    "pct2ResTime" : 23.0,
    "pct3ResTime" : 24.0,
    "throughput" : 2.3872805691276877,
    "receivedKBytesPerSec" : 2.4082625272547866,
    "sentKBytesPerSec" : 0.6574346879824297
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 27.996666666666638,
    "medianResTime" : 25.0,
    "minResTime" : 7.0,
    "maxResTime" : 349.0,
    "pct1ResTime" : 40.0,
    "pct2ResTime" : 57.0,
    "pct3ResTime" : 96.98999999999978,
    "throughput" : 19.878629920651136,
    "receivedKBytesPerSec" : 1845.9656820992939,
    "sentKBytesPerSec" : 8.672634684620014
  },
  "GetCardHolder - 查詢卡片持有者資料" : {
    "transaction" : "GetCardHolder - 查詢卡片持有者資料",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.98666666666668,
    "medianResTime" : 26.0,
    "minResTime" : 24.0,
    "maxResTime" : 74.0,
    "pct1ResTime" : 27.0,
    "pct2ResTime" : 28.0,
    "pct3ResTime" : 35.940000000000055,
    "throughput" : 2.3868437174295285,
    "receivedKBytesPerSec" : 2.279622222310624,
    "sentKBytesPerSec" : 0.6200199500354049
  },
  "UpdatePayDate - 繳交信用卡費" : {
    "transaction" : "UpdatePayDate - 繳交信用卡費",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.273333333333339,
    "medianResTime" : 13.0,
    "minResTime" : 10.0,
    "maxResTime" : 73.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 19.0,
    "pct3ResTime" : 56.76000000000022,
    "throughput" : 2.3873945567404102,
    "receivedKBytesPerSec" : 0.6224944791500876,
    "sentKBytesPerSec" : 0.8486441588413178
  },
  "UpdateCardApprovalStatus - 審核信用卡 更新信用卡狀態" : {
    "transaction" : "UpdateCardApprovalStatus - 審核信用卡 更新信用卡狀態",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 26.273333333333337,
    "medianResTime" : 26.0,
    "minResTime" : 12.0,
    "maxResTime" : 36.0,
    "pct1ResTime" : 28.0,
    "pct2ResTime" : 28.0,
    "pct3ResTime" : 32.99000000000001,
    "throughput" : 2.3869766553683105,
    "receivedKBytesPerSec" : 0.6223855146321668,
    "sentKBytesPerSec" : 1.1002470520838306
  }
}