jmeter/test-result/8-springboot-microservice/statistics.json
{
  "SC0106002-DisputeNotation" : {
    "transaction" : "SC0106002-DisputeNotation",
    "sampleCount" : 300,
    "errorCount" : 38,
    "errorPct" : 12.666667,
    "meanResTime" : 2293.683333333334,
    "medianResTime" : 693.0,
    "minResTime" : 31.0,
    "maxResTime" : 10257.0,
    "pct1ResTime" : 10026.0,
    "pct2ResTime" : 10126.6,
    "pct3ResTime" : 10200.91,
    "throughput" : 11.716004061548075,
    "receivedKBytesPerSec" : 2.7885004979301726,
    "sentKBytesPerSec" : 3.569719987502929
  },
  "SC0107001-FeePayment" : {
    "transaction" : "SC0107001-FeePayment",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3768.393333333334,
    "medianResTime" : 2705.5,
    "minResTime" : 1078.0,
    "maxResTime" : 8944.0,
    "pct1ResTime" : 7249.100000000003,
    "pct2ResTime" : 7688.0,
    "pct3ResTime" : 8802.880000000001,
    "throughput" : 11.398176291793312,
    "receivedKBytesPerSec" : 2.7382337575987843,
    "sentKBytesPerSec" : 3.906992068768997
  },
  "SC0104001-Transaction" : {
    "transaction" : "SC0104001-Transaction",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3547.203333333333,
    "medianResTime" : 1937.5,
    "minResTime" : 976.0,
    "maxResTime" : 9766.0,
    "pct1ResTime" : 7912.300000000002,
    "pct2ResTime" : 8784.05,
    "pct3ResTime" : 9479.92,
    "throughput" : 5.581499190682617,
    "receivedKBytesPerSec" : 1.3408679696366443,
    "sentKBytesPerSec" : 3.6138026986548586
  },
  "SC0103001-Activation" : {
    "transaction" : "SC0103001-Activation",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1647.843333333333,
    "medianResTime" : 1475.0,
    "minResTime" : 923.0,
    "maxResTime" : 3166.0,
    "pct1ResTime" : 2461.4000000000005,
    "pct2ResTime" : 2904.899999999999,
    "pct3ResTime" : 3087.9300000000003,
    "throughput" : 6.223808140741048,
    "receivedKBytesPerSec" : 1.4951726588108378,
    "sentKBytesPerSec" : 1.865926854694826
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2100,
    "errorCount" : 93,
    "errorPct" : 4.428571,
    "meanResTime" : 3359.5985714285666,
    "medianResTime" : 1917.0,
    "minResTime" : 31.0,
    "maxResTime" : 16110.0,
    "pct1ResTime" : 8592.400000000001,
    "pct2ResTime" : 10329.749999999989,
    "pct3ResTime" : 15379.589999999991,
    "throughput" : 30.030459466029832,
    "receivedKBytesPerSec" : 4189.158155057272,
    "sentKBytesPerSec" : 14.064209323027642
  },
  "SC0102001-Review" : {
    "transaction" : "SC0102001-Review",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2435.78,
    "medianResTime" : 2059.0,
    "minResTime" : 934.0,
    "maxResTime" : 5670.0,
    "pct1ResTime" : 4180.6,
    "pct2ResTime" : 4892.3,
    "pct3ResTime" : 5588.680000000001,
    "throughput" : 6.112095837662735,
    "receivedKBytesPerSec" : 1.4683355235010085,
    "sentKBytesPerSec" : 2.1786279108856426
  },
  "SC0101001-Application" : {
    "transaction" : "SC0101001-Application",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3878.033333333339,
    "medianResTime" : 1814.5,
    "minResTime" : 941.0,
    "maxResTime" : 10906.0,
    "pct1ResTime" : 9092.700000000004,
    "pct2ResTime" : 9584.4,
    "pct3ResTime" : 10584.09,
    "throughput" : 5.284667418263811,
    "receivedKBytesPerSec" : 1.26955877430947,
    "sentKBytesPerSec" : 5.424009234956313
  },
  "SC0106001-TransactionQuery" : {
    "transaction" : "SC0106001-TransactionQuery",
    "sampleCount" : 300,
    "errorCount" : 55,
    "errorPct" : 18.333334,
    "meanResTime" : 5946.253333333334,
    "medianResTime" : 4296.5,
    "minResTime" : 112.0,
    "maxResTime" : 16110.0,
    "pct1ResTime" : 14949.800000000001,
    "pct2ResTime" : 15496.25,
    "pct3ResTime" : 16040.66,
    "throughput" : 6.578514571409776,
    "receivedKBytesPerSec" : 6414.312363632875,
    "sentKBytesPerSec" : 1.9786938359318464
  }
}